
/*

	The Implementing of 'Adapter' , Module : 'MMI'.	
	Layer belong : 'Static Components'.
	For more details about 'Adapter' you could read : "The_i51_SC_Adapter_Interfaces.xls"
	For more details about 'Static Components' you could read : "The_i51_Architecture_2.0.xls"
	
	The 51PK Platform was implementing based on 'The i51 Architecture'.
	'The i51 Architecture' is designed by osca.
	
	Copyright (C) 2011 , PKIG Tech. Co., Ltd.
 
*/
#include "i51AdeCnf.h"
#include "i51AdeMmi.h"
#include "i51Script.h"
#include "i51AdeMStar.h"


#include "ven_std.h"
#include "ven_sdk.h"
#include "ven_handle.h"
#include "ven_graphics.h"
#include "ven_font.h"     
#include "ven_stc.h"
#include "ven_ts.h"
#include "ven_os.h"
#include "ven_kpd.h"
#include "ven_setting.h"
#include "ven_clipboard.h"
#include "ven_dbg.h"
#include "ven_drv.h"
#include "ven_codec.h"
#include "ven_socket.h"
#include "ven_util.h"
#include "ven_ui.h"
#include "ven_wap.h"
#include "ven_cam.h"
#include "ven_editor.h"
#include "ven_msg.h"
#include "ven_time.h"

//#define i51ADAPTER_DEBUG

#define R_OF_565(p)      (((p)&0xf800) >> 8)
#define G_OF_565(p)      (((p)&0x7e0) >> 3)
#define B_OF_565(p)      (((p)&0x1f) << 3)

extern iU32 g_i51PkigHandle;

extern void* i51AdeOsMalloc ( iU32 length , const iCHAR* file , iU32 line );
extern void i51AdeStdMemset16(void* dest, iU16 value, iU32 length);
extern iU16 *i51S_AdeFileFixPath(const iU16 *oldpath); //外部引用，非标准接口

typedef void (*i51PlayerCB)(iHANDLE handle);    
typedef void (*i51ADEPLAYRECORDCB)( iBOOL results );   

extern ven_GraphicsCanvas *g_i51PkigCanvas ;
extern iS32 g_i51MediaHandle ;
extern ven_FontAttr *g_i51PkigFontNormal ;

i51RecoderStruct  i51Recoder = { 0 } ;
I51_RECORDER_ACTION_FLAG g_i51RecorderActionFlag = I51_RECORDER_ACTION_NONE;


static i51ADECALLBACK i51AdeCallback = 0 ;
static i51ADECALLBACK i51RecorderStop = 0 ;
static i51ADEPLAYRECORDCB i51PlayRecordCb = 0 ; 
static iBOOL i51AdeMmiMediaPlayerLock = iFALSE ;
static iBOOL i51AdeMmiMediaPlaying = iFALSE ;
static iU32 g_i51LastVolume = VEN_MEDIA_VOLUME_0;
/*========================================================
	Media Player -- start
=========================================================*/
static void _i51AdeMmiMediaPlayerMessageProcessing( iU32 timerid );
static iBOOL _i51AdeMediaPlayerDeviceStopPlayImmediately();
static iBOOL _i51AdeMmiMediaPlayerIsWorking();

extern iS32 g_i51MediaHandle;
extern iU32 g_i51PkigHandle;


#define I51_MEDIA_PLAYER_OBJECT_NUM			(8)
#define I51_MEDIA_PLAYER_MESSAGE_QUEUE_SIZE	(32)
#define I51_MEIDA_PLAYER_INVALIDATE_ID		(0xFF)
#define I51_WAV_HEAD_LEN					(44)
#define I51_MEDIA_PLAYER_SECTOR_NUM			(3)
#define I51_MEDIA_PLAYER_SECTOR_SIZE		(1024 * 50)

typedef enum
{
	i51_PLAYMODE_MIX = 0,
	i51_PLAYMODE_SINGLE,
	i51_PLAYMODE_INVALIDATE
}i51PLAYMODE;

typedef enum
{
	i51_PLAYSTATUS_PLAYING = 0,
	i51_PLAYSTATUS_PAUSE,
	i51_PLAYSTATUS_STOP
}i51PLAYSTATUS;

typedef struct{
	char magic[4];		//0x52, 0x49, 0x46, 0x46 "RIFF"标志 
	int  len;			//文件长度 - 8 
	char wav[4];		//0x57, 0x41, 0x56, 0x45   "WAVE"标志 
	char fmt[4];		//0x66, 0x6D, 0x74, 0x20, // "fmt"标志 
	int  ignore;		//0x10,0x00,0x00,0x00 
	u16  format; 		//0x01,0x00 格式类别（10H为PCM形式的声音数据) 
	u16  channel;		//0x01  通道数
	int  sample; 		 //0x40, 0x1F,0x00,0x00   采样率
	int  nAvgBytesPerSec; //0x80,0x3E,0x00,0x00 波形音频数据传送速率，其值为通道数×每秒数据位数×每   样本的数据位数／8。播放软件利用此值可以估计缓冲区的大小。 
	u16  align; 		//0x02  数据块的调整数（按字节算的），其值为通道数×每样本的数据位值／8
	u16  elemt; 		//0x10 每样本的数据位数，表示每个声道中各个样本的数据位数。
	char data[4];		//0x64, 0x61, 0x74, 0x61,数据标记符＂data＂ 
	int  pcmlen; 		//pcm len 语音数据的长度
}wavheader_t;

typedef enum
{
	i51_WAVSAMPLE_8_KHZ = 0,
	i51_WAVSAMPLE_11_025_KHZ,
	i51_WAVSAMPLE_12_KHZ,
	i51_WAVSAMPLE_16_KHZ,
	i51_WAVSAMPLE_22_KHZ,
	i51_WAVSAMPLE_24_KHZ,
	i51_WAVSAMPLE_32_KHZ,
	i51_WAVSAMPLE_44_1_KHZ,
	i51_WAVSAMPLE_48_KHZ,
	i51_WAVSAMPLE_64_KHZ,
	i51_WAVSAMPLE_96_KHZ,
	i51_WAVSAMPLE_MAX
}i51WAVSAMPLE;

typedef struct
{
	i51WAVSAMPLE eSampleType;
	iU8 nBit;
	iS32 sampleValue;
}i51WavSampleStruct;

static const i51WavSampleStruct stWavSample[] = 
{
	{i51_WAVSAMPLE_8_KHZ,  8 , 8000},
	{i51_WAVSAMPLE_16_KHZ, 16, 16000},
	{i51_WAVSAMPLE_24_KHZ, 24, 24000},
	{i51_WAVSAMPLE_32_KHZ, 32, 32000},
	{i51_WAVSAMPLE_48_KHZ, 48, 48000},
	{i51_WAVSAMPLE_64_KHZ, 64, 64000},
	{i51_WAVSAMPLE_96_KHZ, 96, 96000},
};

typedef struct
{
	iBOOL	bUsed;				//是否被使用
	void*	handle;				//句柄
	iU32	priority;			//优先级
	iU32	length;				//数据长度
	iU32	codec;				//数据类型
